Repository: nvdaaddons/DirectLink
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: pt_br, ru

source: Converts the given link to a direct link.
pt_br: Converte o link fornecido para um link direto.
ru: Преобразует данную ссылку в прямую ссылку.

source: The link has been previously converted, press NVDA+alt+o to open it in browser.
pt_br: O link foi convertido anteriormente, pressione NVDA+alt+o para abri-lo no navegador.
ru: Ссылка была ранее преобразована, нажмите NVDA+alt+o, чтобы открыть его в браузере.

source: The Dropbox link has been converted and copied to the clipboard, press NVDA+alt+o to open it in browser.
pt_br: O link do Dropbox foi convertido e copiado para a área de transferência. Pressione NVDA+alt+o para abri-lo no navegador.
ru: Ссылка Dropbox была преобразована и скопирована в буфер обмена, нажмите NVDA+alt+o, чтобы открыть его в браузере.

source: The Google Drive link has been converted and copied to the clipboard, press nvda+alt+o to open it in browser.
pt_br: O link do OneDrive foi convertido e copiado para a área de transferência, pressione alt+nvda+o para abri-lo no navegador.
ru: Ссылка на Google Диск преобразована и скопирована в буфер обмена, нажмите NVDA+alt+o, чтобы открыть его в браузере.

source: The oneDrive link has been converted and copied to the clipboard, press nvda+alt+o to open it in browser.
pt_br: O link do OneDrive foi convertido e copiado para a área de transferência. Pressione nvda+alt+o para abri-lo no navegador.
ru: Ссылка oneDrive была преобразована и скопирована в буфер обмена, нажмите NVDA+alt+o, чтобы открыть его в браузере.

source: the oneDrive link has been converted and copied to the clipboard, press alt+nvda+o to open it in browser
pt_br: o link do OneDrive foi convertido e copiado para a área de transferência, pressione alt+nvda+o para abri-lo no navegador
ru: ссылка oneDrive была преобразована и скопирована в буфер обмена, нажмите NVDA+alt+o, чтобы открыть его в браузере

source: The WhatsApp link has been generated and copied to the clipboard, press NVDA+alt+o to open it in browser.
pt_br: O link do WhatsApp foi gerado e copiado para a área de transferência. Pressione NVDA+alt+o para abri-lo no navegador.
ru: Ссылка WhatsApp создана и скопирована в буфер обмена, нажмите NVDA+alt+o, чтобы открыть его в браузере.

source: Please select or copy a dropbox link, a google drive link or a oneDrive link to convert, or a WhatsApp number to chat with.
pt_br: Selecione ou copie um link dropbox, um link do google drive ou do oneDrive para converter ou um número do WhatsApp para conversar.
ru: Выберите или скопируйте ссылку на Dropbox, ссылку на Google Диск или OneDrive для преобразования или номер WhatsApp для чата.

source: Converts a username or a number to a Telegram link
pt_br: Converte um nome de usuário ou um número em um link do Telegram
ru: Преобразует имя пользователя или номер в ссылку Telegram

source: Your clipboard is empty or does not contain text.
pt_br: Sua área de transferência está vazia ou não contém texto.
ru: Ваш буфер обмена пуст или не содержит текста.

source: The Telegram link has been previously generated, press NVDA+alt+o to open it in browser.
pt_br: O link do Telegram foi gerado anteriormente, pressione NVDA+alt+o para abri-lo no navegador.
ru: Ссылка на Telegram была сгенерирована ранее, нажмите NVDA+alt+o, чтобы открыть его в браузере.

source: The phone number has been converted, press NVDA+Alt+O to open the link in browser.
pt_br: O número de telefone foi convertido, pressione NVDA+Alt+O para abrir o link no navegador.
ru: Номер телефона был преобразован, нажмите NVDA+alt+o, чтобы открыть его в браузере.

source: The username has been converted, press NVDA+alt+o to open the link in browser.
pt_br: O nome de usuário foi convertido. Pressione NVDA+alt+o para abrir o link no navegador.
ru: Имя пользователя было преобразовано, нажмите NVDA+alt+o, чтобы открыть его в браузере.

source: Select a valid phone number or username to generate its Telegram link.
pt_br: Selecione um número de telefone ou nome de usuário válido para gerar o link do Telegram.
ru: Выберите действительный номер телефона или имя пользователя, чтобы сгенерировать его ссылку Telegram.

source: Opens the converted link in browser.
pt_br: Abre o link convertido no navegador.
ru: Открывает преобразованную ссылку в браузере.

source: No link has been converted.
pt_br: Nenhum link foi convertido.
ru: Ни одна ссылка не была преобразована.

source: Direct Link
pt_br: Endereço Direto
ru: Прямая ссылка

source: Converts dropbox, google drive or oneDrive links to direct links, and opens Whatsapp and Telegram chats with the given number.
pt_br: Converte links do Dropbox, Google Drive ou OneDrive em links diretos e abre bate-papos do Whatsapp e do Telegram com o número fornecido.
ru: Преобразует ссылки Dropbox, Google Диск или OneDrive в прямые ссылки и открывает чаты Whatsapp и Telegram с заданным номером.
